Docker/Results/NoFirewall/Fio/results_2.txt
hostname=5813664fe526, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.36, flags=1
<5813664fe526> write-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<5813664fe526> ...
<5813664fe526> Starting 4 processes
<5813664fe526> 
write-test: (groupid=0, jobs=1): err= 0: pid=322: Tue Dec 10 19:07:04 2024
  read: IOPS=13.0k, BW=50.7MiB/s (53.2MB/s)(14.9GiB/300001msec)
    slat (nsec): min=1769, max=3314.6k, avg=3350.95, stdev=2568.21
    clat (usec): min=2, max=20080, avg=73.01, stdev=28.36
     lat (usec): min=11, max=20083, avg=76.36, stdev=28.62
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   77], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  206], 99.95th=[  260],
     | 99.99th=[  644]
   bw (  KiB/s): min=47080, max=58392, per=25.01%, avg=51964.43, stdev=1185.54, samples=599
   iops        : min=11770, max=14598, avg=12991.11, stdev=296.40, samples=599
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=2.41%, 100=93.13%
  lat (usec)   : 250=4.39%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.01%
  cpu          : usr=1.97%, sys=6.89%, ctx=3899791, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3896821,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=323: Tue Dec 10 19:07:04 2024
  read: IOPS=13.0k, BW=50.7MiB/s (53.2MB/s)(14.9GiB/300001msec)
    slat (nsec): min=1775, max=452405, avg=3358.23, stdev=1852.86
    clat (usec): min=2, max=19860, avg=73.06, stdev=28.59
     lat (usec): min=12, max=19868, avg=76.42, stdev=28.79
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   78], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  210], 99.95th=[  265],
     | 99.99th=[  693]
   bw (  KiB/s): min=46760, max=58416, per=24.99%, avg=51918.42, stdev=1192.56, samples=599
   iops        : min=11690, max=14604, avg=12979.60, stdev=298.14, samples=599
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=2.38%, 100=93.15%
  lat (usec)   : 250=4.41%, 500=0.05%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=2.06%, sys=6.82%, ctx=3896271, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3893344,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=324: Tue Dec 10 19:07:04 2024
  read: IOPS=13.0k, BW=50.7MiB/s (53.2MB/s)(14.9GiB/300001msec)
    slat (nsec): min=1733, max=840557, avg=3342.36, stdev=1894.91
    clat (usec): min=2, max=20135, avg=73.03, stdev=28.73
     lat (usec): min=11, max=20137, avg=76.37, stdev=28.94
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   78], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  208], 99.95th=[  265],
     | 99.99th=[  709]
   bw (  KiB/s): min=47056, max=58808, per=25.01%, avg=51959.51, stdev=1172.62, samples=599
   iops        : min=11764, max=14702, avg=12989.87, stdev=293.16, samples=599
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=2.41%, 100=93.14%
  lat (usec)   : 250=4.38%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.01%
  cpu          : usr=1.99%, sys=6.85%, ctx=3899408, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3896485,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=325: Tue Dec 10 19:07:04 2024
  read: IOPS=13.0k, BW=50.7MiB/s (53.2MB/s)(14.9GiB/300001msec)
    slat (nsec): min=1770, max=575127, avg=3366.54, stdev=1863.36
    clat (nsec): min=1561, max=20020k, avg=73047.62, stdev=28512.19
     lat (usec): min=12, max=20025, avg=76.41, stdev=28.72
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   78], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  208], 99.95th=[  262],
     | 99.99th=[  676]
   bw (  KiB/s): min=46720, max=58768, per=25.00%, avg=51928.31, stdev=1173.65, samples=599
   iops        : min=11680, max=14692, avg=12982.08, stdev=293.41, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.38%
  lat (usec)   : 100=93.14%, 250=4.41%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 50=0.01%
  cpu          : usr=2.00%, sys=6.90%, ctx=3896957, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3894085,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=203MiB/s (213MB/s), 50.7MiB/s-50.7MiB/s (53.2MB/s-53.2MB/s), io=59.4GiB (63.8GB), run=300001-300001msec
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 19:07:04 2024
  read: IOPS=51.9k, BW=203Mi (213M)(59.4GiB/300001msec)
    slat (nsec): min=1733, max=3314.6k, avg=3354.52, stdev=2067.20
    clat (nsec): min=1561, max=20135k, avg=73037.69, stdev=28548.30
     lat (usec): min=11, max=20137, avg=76.39, stdev=28.77
   bw (  KiB/s): min=187616, max=234384, per=25.00%, avg=207770.67, stdev=1180.38, samples=2396
   iops        : min=46904, max=58596, avg=51942.66, stdev=295.10, samples=2396
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.39%
  lat (usec)   : 100=93.14%, 250=4.40%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=2.00%, sys=6.87%, ctx=15592427, majf=0, minf=62
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=15580735,0,0,0 short=0,0,0,0 dropped=0,0,0,0