Docker/Results/NoFirewall/Fio/results_3.txt
hostname=5813664fe526, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.36, flags=1
<5813664fe526> write-test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<5813664fe526> ...
<5813664fe526> Starting 4 processes
<5813664fe526> 
write-test: (groupid=0, jobs=1): err= 0: pid=345: Tue Dec 10 19:15:23 2024
  read: IOPS=13.0k, BW=50.8MiB/s (53.3MB/s)(14.9GiB/300001msec)
    slat (nsec): min=1730, max=1178.8k, avg=3308.46, stdev=1951.78
    clat (nsec): min=1105, max=6062.0k, avg=72950.62, stdev=26593.23
     lat (usec): min=11, max=6100, avg=76.26, stdev=26.81
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   77], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  208], 99.95th=[  262],
     | 99.99th=[  644]
   bw (  KiB/s): min=47648, max=53912, per=25.01%, avg=52045.48, stdev=1109.71, samples=599
   iops        : min=11912, max=13478, avg=13011.37, stdev=277.42, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.25%
  lat (usec)   : 100=93.33%, 250=4.36%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.93%, sys=6.82%, ctx=3905816, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3902857,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=346: Tue Dec 10 19:15:23 2024
  read: IOPS=13.0k, BW=50.8MiB/s (53.3MB/s)(14.9GiB/300001msec)
    slat (nsec): min=1728, max=338833, avg=3309.55, stdev=1801.71
    clat (nsec): min=1690, max=6062.0k, avg=72973.29, stdev=26855.77
     lat (usec): min=12, max=6100, avg=76.28, stdev=27.06
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   77], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  208], 99.95th=[  262],
     | 99.99th=[  644]
   bw (  KiB/s): min=47744, max=54032, per=25.00%, avg=52025.00, stdev=1114.28, samples=599
   iops        : min=11936, max=13508, avg=13006.25, stdev=278.57, samples=599
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.26%
  lat (usec)   : 100=93.31%, 250=4.38%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.96%, sys=6.81%, ctx=3904195, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3901310,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=347: Tue Dec 10 19:15:23 2024
  read: IOPS=13.0k, BW=50.8MiB/s (53.3MB/s)(14.9GiB/300001msec)
    slat (nsec): min=1736, max=938593, avg=3323.22, stdev=1900.21
    clat (nsec): min=762, max=6077.2k, avg=72978.79, stdev=26448.49
     lat (usec): min=11, max=6116, avg=76.30, stdev=26.67
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   77], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  206], 99.95th=[  260],
     | 99.99th=[  668]
   bw (  KiB/s): min=47416, max=54040, per=24.99%, avg=52012.30, stdev=1121.04, samples=599
   iops        : min=11854, max=13510, avg=13003.08, stdev=280.26, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.23%
  lat (usec)   : 100=93.30%, 250=4.40%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.97%, sys=6.84%, ctx=3903254, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3900299,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write-test: (groupid=0, jobs=1): err= 0: pid=348: Tue Dec 10 19:15:23 2024
  read: IOPS=13.0k, BW=50.8MiB/s (53.3MB/s)(14.9GiB/300000msec)
    slat (nsec): min=1706, max=523256, avg=3310.24, stdev=1844.27
    clat (nsec): min=929, max=6061.7k, avg=72954.76, stdev=26337.33
     lat (usec): min=11, max=6099, avg=76.26, stdev=26.55
    clat percentiles (usec):
     |  1.00th=[   45],  5.00th=[   60], 10.00th=[   61], 20.00th=[   64],
     | 30.00th=[   66], 40.00th=[   70], 50.00th=[   73], 60.00th=[   74],
     | 70.00th=[   75], 80.00th=[   77], 90.00th=[   86], 95.00th=[   97],
     | 99.00th=[  137], 99.50th=[  143], 99.90th=[  208], 99.95th=[  262],
     | 99.99th=[  635]
   bw (  KiB/s): min=47696, max=54312, per=25.01%, avg=52041.94, stdev=1096.18, samples=599
   iops        : min=11924, max=13578, avg=13010.48, stdev=274.05, samples=599
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.25%
  lat (usec)   : 100=93.33%, 250=4.36%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.97%, sys=6.79%, ctx=3905452, majf=0, minf=17
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3902573,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=203MiB/s (213MB/s), 50.8MiB/s-50.8MiB/s (53.3MB/s-53.3MB/s), io=59.5GiB (63.9GB), run=300000-300001msec
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 19:15:23 2024
  read: IOPS=52.0k, BW=203Mi (213M)(59.5GiB/300001msec)
    slat (nsec): min=1706, max=1178.8k, avg=3312.87, stdev=1875.36
    clat (nsec): min=762, max=6077.2k, avg=72964.36, stdev=26559.40
     lat (usec): min=11, max=6116, avg=76.28, stdev=26.77
   bw (  KiB/s): min=190504, max=216296, per=25.00%, avg=208124.71, stdev=1109.64, samples=2396
   iops        : min=47626, max=54074, avg=52031.18, stdev=277.41, samples=2396
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=2.25%
  lat (usec)   : 100=93.32%, 250=4.37%, 500=0.04%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.96%, sys=6.82%, ctx=15618717, majf=0, minf=63
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=15607039,0,0,0 short=0,0,0,0 dropped=0,0,0,0